MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EZR32LG330F128R60/mcu.h
/** @} End of group EZR32LG330F128R60_RF_Interface */

// #include "core_cm3.h"     /* Cortex-M3 processor and core peripherals */  // Note: Changed for MikroE implementation.
// #include "system_ezr32lg.h" /* System Header */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EZR32LG330F128R60_Part */

/***************************************************************************//**
 * @defgroup EZR32LG330F128R60_Peripheral_TypeDefs EZR32LG330F128R60 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "ezr32lg_dma_ch.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dma.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_aes.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usb_hc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usb_diep.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usb_doep.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usb.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_msc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_emu.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_rmu.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_cmu.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usart.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_timer.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_acmp.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_leuart.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_rtc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_letimer.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_i2c.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_gpio.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_vcmp.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_prs.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_adc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dac.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_burtc_ret.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_burtc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_wdog.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_etm.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_romtable.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_calibrate.h"  // Note: Changed for MikroE implementation.

/** @} End of group EZR32LG330F128R60_Peripheral_TypeDefs */

/***************************************************************************//**
 * @defgroup EZR32LG330F128R60_Peripheral_Base EZR32LG330F128R60 Peripheral Memory Map
 * @{
 ******************************************************************************/

#define DMA_BASE          (0x400C2000UL) /**< DMA base address  */
#define AES_BASE          (0x400E0000UL) /**< AES base address  */
#define USB_BASE          (0x400C4000UL) /**< USB base address  */
#define MSC_BASE          (0x400C0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400C6000UL) /**< EMU base address  */
#define RMU_BASE          (0x400CA000UL) /**< RMU base address  */
#define CMU_BASE          (0x400C8000UL) /**< CMU base address  */
#define LESENSE_BASE      (0x4008C000UL) /**< LESENSE base address  */
#define USARTRF0_BASE     (0x4000C000UL) /**< USARTRF0 base address  */
#define USART1_BASE       (0x4000C400UL) /**< USART1 base address  */
#define USART2_BASE       (0x4000C800UL) /**< USART2 base address  */
#define UART0_BASE        (0x4000E000UL) /**< UART0 base address  */
#define UART1_BASE        (0x4000E400UL) /**< UART1 base address  */
#define TIMER0_BASE       (0x40010000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40010400UL) /**< TIMER1 base address  */
#define TIMER2_BASE       (0x40010800UL) /**< TIMER2 base address  */
#define TIMER3_BASE       (0x40010C00UL) /**< TIMER3 base address  */
#define ACMP0_BASE        (0x40001000UL) /**< ACMP0 base address  */
#define ACMP1_BASE        (0x40001400UL) /**< ACMP1 base address  */
#define LEUART0_BASE      (0x40084000UL) /**< LEUART0 base address  */
#define LEUART1_BASE      (0x40084400UL) /**< LEUART1 base address  */
#define RTC_BASE          (0x40080000UL) /**< RTC base address  */
#define LETIMER0_BASE     (0x40082000UL) /**< LETIMER0 base address  */
#define PCNT0_BASE        (0x40086000UL) /**< PCNT0 base address  */
#define PCNT1_BASE        (0x40086400UL) /**< PCNT1 base address  */
#define PCNT2_BASE        (0x40086800UL) /**< PCNT2 base address  */
#define I2C0_BASE         (0x4000A000UL) /**< I2C0 base address  */
#define I2C1_BASE         (0x4000A400UL) /**< I2C1 base address  */
#define GPIO_BASE         (0x40006000UL) /**< GPIO base address  */
#define VCMP_BASE         (0x40000000UL) /**< VCMP base address  */
#define PRS_BASE          (0x400CC000UL) /**< PRS base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define DAC0_BASE         (0x40004000UL) /**< DAC0 base address  */
#define BURTC_BASE        (0x40081000UL) /**< BURTC base address  */
#define WDOG_BASE         (0x40088000UL) /**< WDOG base address  */
#define ETM_BASE          (0xE0041000UL) /**< ETM base address  */
#define CALIBRATE_BASE    (0x0FE08000UL) /**< CALIBRATE base address */
#define DEVINFO_BASE      (0x0FE081A8UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xE00FFFD0UL) /**< ROMTABLE base address */
#define LOCKBITS_BASE     (0x0FE04000UL) /**< Lock-bits page base address */
#define USERDATA_BASE     (0x0FE00000UL) /**< User data page base address */

/** @} End of group EZR32LG330F128R60_Peripheral_Base */

/***************************************************************************//**
 * @defgroup EZR32LG330F128R60_Peripheral_Declaration  EZR32LG330F128R60 Peripheral Declarations
 * @{
 ******************************************************************************/

#define DMA          ((DMA_TypeDef *) DMA_BASE)             /**< DMA base pointer */
#define AES          ((AES_TypeDef *) AES_BASE)             /**< AES base pointer */
#define USB          ((USB_TypeDef *) USB_BASE)             /**< USB base pointer */
#define MSC          ((MSC_TypeDef *) MSC_BASE)             /**< MSC base pointer */
#define EMU          ((EMU_TypeDef *) EMU_BASE)             /**< EMU base pointer */
#define RMU          ((RMU_TypeDef *) RMU_BASE)             /**< RMU base pointer */
#define CMU          ((CMU_TypeDef *) CMU_BASE)             /**< CMU base pointer */
#define LESENSE      ((LESENSE_TypeDef *) LESENSE_BASE)     /**< LESENSE base pointer */
#define USARTRF0     ((USART_TypeDef *) USARTRF0_BASE)      /**< USARTRF0 base pointer */
#define USART1       ((USART_TypeDef *) USART1_BASE)        /**< USART1 base pointer */
#define USART2       ((USART_TypeDef *) USART2_BASE)        /**< USART2 base pointer */
#define UART0        ((USART_TypeDef *) UART0_BASE)         /**< UART0 base pointer */
#define UART1        ((USART_TypeDef *) UART1_BASE)         /**< UART1 base pointer */
#define TIMER0       ((TIMER_TypeDef *) TIMER0_BASE)        /**< TIMER0 base pointer */
#define TIMER1       ((TIMER_TypeDef *) TIMER1_BASE)        /**< TIMER1 base pointer */
#define TIMER2       ((TIMER_TypeDef *) TIMER2_BASE)        /**< TIMER2 base pointer */
#define TIMER3       ((TIMER_TypeDef *) TIMER3_BASE)        /**< TIMER3 base pointer */
#define ACMP0        ((ACMP_TypeDef *) ACMP0_BASE)          /**< ACMP0 base pointer */
#define ACMP1        ((ACMP_TypeDef *) ACMP1_BASE)          /**< ACMP1 base pointer */
#define LEUART0      ((LEUART_TypeDef *) LEUART0_BASE)      /**< LEUART0 base pointer */
#define LEUART1      ((LEUART_TypeDef *) LEUART1_BASE)      /**< LEUART1 base pointer */
#define RTC          ((RTC_TypeDef *) RTC_BASE)             /**< RTC base pointer */
#define LETIMER0     ((LETIMER_TypeDef *) LETIMER0_BASE)    /**< LETIMER0 base pointer */
#define PCNT0        ((PCNT_TypeDef *) PCNT0_BASE)          /**< PCNT0 base pointer */
#define PCNT1        ((PCNT_TypeDef *) PCNT1_BASE)          /**< PCNT1 base pointer */
#define PCNT2        ((PCNT_TypeDef *) PCNT2_BASE)          /**< PCNT2 base pointer */
#define I2C0         ((I2C_TypeDef *) I2C0_BASE)            /**< I2C0 base pointer */
#define I2C1         ((I2C_TypeDef *) I2C1_BASE)            /**< I2C1 base pointer */
#define GPIO         ((GPIO_TypeDef *) GPIO_BASE)           /**< GPIO base pointer */
#define VCMP         ((VCMP_TypeDef *) VCMP_BASE)           /**< VCMP base pointer */
#define PRS          ((PRS_TypeDef *) PRS_BASE)             /**< PRS base pointer */
#define ADC0         ((ADC_TypeDef *) ADC0_BASE)            /**< ADC0 base pointer */
#define DAC0         ((DAC_TypeDef *) DAC0_BASE)            /**< DAC0 base pointer */
#define BURTC        ((BURTC_TypeDef *) BURTC_BASE)         /**< BURTC base pointer */
#define WDOG         ((WDOG_TypeDef *) WDOG_BASE)           /**< WDOG base pointer */
#define ETM          ((ETM_TypeDef *) ETM_BASE)             /**< ETM base pointer */
#define CALIBRATE    ((CALIBRATE_TypeDef *) CALIBRATE_BASE) /**< CALIBRATE base pointer */
#define DEVINFO      ((DEVINFO_TypeDef *) DEVINFO_BASE)     /**< DEVINFO base pointer */
#define ROMTABLE     ((ROMTABLE_TypeDef *) ROMTABLE_BASE)   /**< ROMTABLE base pointer */

/** @} End of group EZR32LG330F128R60_Peripheral_Declaration */

/***************************************************************************//**
 * @defgroup EZR32LG330F128R60_BitFields EZR32LG330F128R60 Bit Fields
 * @{
 ******************************************************************************/

// #include "ezr32lg_prs_signals.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dmareq.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dmactrl.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usartrf.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_uart.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EZR32LG330F128R60_UNLOCK EZR32LG330F128R60 Unlock Codes
 * @{
 ******************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */
#define BURTC_UNLOCK_CODE    0xAEE8 /**< BURTC unlock code */

/** @} End of group EZR32LG330F128R60_UNLOCK */

/** @} End of group EZR32LG330F128R60_BitFields */

/***************************************************************************//**
 * @defgroup EZR32LG330F128R60_Alternate_Function EZR32LG330F128R60 Alternate Function
 * @{
 ******************************************************************************/

// #include "ezr32lg_af_ports.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_af_pins.h"  // Note: Changed for MikroE implementation.

/** @} End of group EZR32LG330F128R60_Alternate_Function */

/***************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to up2026-05-13
 *  @param MASK
 *       The mask for the bit field to up2026-05-13
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 ******************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EZR32LG330F128R60 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* EZR32LG330F128R60_H */
